tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/system/cellSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name filter;

action new;

topoSetSources
(
    // Cells with cell centre within box
    boxToCell
    {
       box   (1.5 -1 -1) (2 1 1);
    }
);


// ************************************************************************* //
